In [3]:
from pandas import Series,DataFrame
import pandas as pd

In [7]:
spd = pd.Series([0,10,20,30,40,50,60,70,80,90],index=['a','b','c','d','e','f','h','h','i','j'])
print (spd)

a     0
b    10
c    20
d    30
e    40
f    50
h    60
h    70
i    80
j    90
dtype: int64

In [12]:
print (spd.index)
print (spd.values)

Index(['a', 'b', 'c', 'd', 'e', 'f', 'h', 'h', 'i', 'j'], dtype='object')
[ 0 10 20 30 40 50 60 70 80 90]

In [15]:
ad = {'ID':['100','101','102','103','104'],
     'City':['Tokyo','Osaka','Kyoto','Hokkaido','Tokyo'],
     'Birth_year':[1990,1989,1992,1997,1982],
     'Name':['Hiroshi','Akiko','Yuki','Satoru','Steve']}
adf = DataFrame(ad)
print (adf)

    ID      City  Birth_year     Name
0  100     Tokyo        1990  Hiroshi
1  101     Osaka        1989    Akiko
2  102     Kyoto        1992     Yuki
3  103  Hokkaido        1997   Satoru
4  104     Tokyo        1982    Steve

In [18]:
adf

    ID      City  Birth_year     Name
0  100     Tokyo        1990  Hiroshi
1  101     Osaka        1989    Akiko
2  102     Kyoto        1992     Yuki
3  103  Hokkaido        1997   Satoru
4  104     Tokyo        1982    Steve

In [19]:
adf.T

                  0      1      2         3      4
ID              100    101    102       103    104
City          Tokyo  Osaka  Kyoto  Hokkaido  Tokyo
Birth_year     1990   1989   1992      1997   1982
Name        Hiroshi  Akiko   Yuki    Satoru  Steve

In [24]:
adf.Birth_year

0    1990
1    1989
2    1992
3    1997
4    1982
Name: Birth_year, dtype: int64

In [30]:
adf[['Birth_year','ID']]

   Birth_year   ID
0        1990  100
1        1989  101
2        1992  102
3        1997  103
4        1982  104

In [54]:
adf[['Birth_year']]

   Birth_year
0        1990
1        1989
2        1992
3        1997
4        1982

In [52]:
type(adf[['Birth_year']])

pandas.core.frame.DataFrame

In [55]:
adf['Birth_year']

0    1990
1    1989
2    1992
3    1997
4    1982
Name: Birth_year, dtype: int64

In [53]:
type(adf['Birth_year'])

pandas.core.series.Series

In [37]:
adf[adf['City'] == 'Osaka']

    ID   City  Birth_year   Name
1  101  Osaka        1989  Akiko

In [39]:
adf[adf.City == 'Osaka']

    ID   City  Birth_year   Name
1  101  Osaka        1989  Akiko

In [57]:
adf[adf.City.isin(['Osaka','Tokyo'])]

    ID   City  Birth_year     Name
0  100  Tokyo        1990  Hiroshi
1  101  Osaka        1989    Akiko
4  104  Tokyo        1982    Steve

In [64]:
# 実際に削除されるわけではない
adf.drop(['ID'],axis = 1)

       City  Birth_year     Name
0     Tokyo        1990  Hiroshi
1     Osaka        1989    Akiko
2     Kyoto        1992     Yuki
3  Hokkaido        1997   Satoru
4     Tokyo        1982    Steve

In [72]:
#複数行削除する場合は0,1,2
adf.drop([0,1,2],axis=0)

    ID      City  Birth_year    Name
3  103  Hokkaido        1997  Satoru
4  104     Tokyo        1982   Steve

In [75]:
ad = {'ID':['100','101','102','103','104'],
     'City':['Tokyo','Osaka','Kyoto','Hokkaido','Tokyo'],
     'Birth_year':[1990,1989,1992,1997,1982],
     'Name':['Hiroshi','Akiko','Yuki','Satoru','Steve']}
adf = DataFrame(ad)
adf

    ID      City  Birth_year     Name
0  100     Tokyo        1990  Hiroshi
1  101     Osaka        1989    Akiko
2  102     Kyoto        1992     Yuki
3  103  Hokkaido        1997   Satoru
4  104     Tokyo        1982    Steve

In [86]:
ad ={'ID':['100','101','102','103','104'],
      'Math':[50,40,50,60,70],
      'English':[90,80,70,60,80],
      'Sex':['M','F','F','M','F']}
adf2 = DataFrame(ad)
adf2

    ID  Math  English Sex
0  100    50       90   M
1  101    40       80   F
2  102    50       70   F
3  103    60       60   M
4  104    70       80   F

In [78]:
# 結合条件が指定しなければ同一ラベルのものを使って結合する
pd.merge(adf,adf2)

    ID      City  Birth_year     Name  Math  English Sex
0  100     Tokyo        1990  Hiroshi    50       90   M
1  101     Osaka        1989    Akiko    40       80   F
2  102     Kyoto        1992     Yuki    50       70   F
3  103  Hokkaido        1997   Satoru    60       60   M
4  104     Tokyo        1982    Steve    70       80   M

In [87]:
pdm = pd.merge(adf,adf2)
pdm

    ID      City  Birth_year     Name  Math  English Sex
0  100     Tokyo        1990  Hiroshi    50       90   M
1  101     Osaka        1989    Akiko    40       80   F
2  102     Kyoto        1992     Yuki    50       70   F
3  103  Hokkaido        1997   Satoru    60       60   M
4  104     Tokyo        1982    Steve    70       80   F

In [92]:
pdm.groupby('Sex')['Math'].mean()

Sex
F    53.333333
M    55.000000
Name: Math, dtype: float64

In [95]:
pdm.groupby('Sex')['English'].min()

Sex
F    70
M    60
Name: English, dtype: int64

In [96]:
# groupbyも複数指定できる
pdm.groupby(['City','Sex']).mean()

              Birth_year  Math  English
City     Sex
Hokkaido M          1997    60       60
Kyoto    F          1992    50       70
Osaka    F          1989    40       80
Tokyo    F          1982    70       80
         M          1990    50       90

In [102]:
pdm.Math.sort_values()

1    40
0    50
2    50
3    60
4    70
Name: Math, dtype: int64

In [111]:
pdm.sort_values(['Math','English'],ascending= False)

    ID      City  Birth_year     Name  Math  English Sex
4  104     Tokyo        1982    Steve    70       80   F
3  103  Hokkaido        1997   Satoru    60       60   M
0  100     Tokyo        1990  Hiroshi    50       90   M
2  102     Kyoto        1992     Yuki    50       70   F
1  101     Osaka        1989    Akiko    40       80   F

In [114]:
attr = {'ID':['1','2','3','4','5'],
       'Sex':['F','F','M','M','F'],
        'Money':[1000,2000,500,300,700],
        'Name':['Saito','Horie','Kondo','Kawada','Matsubara']
       }
attr_df = DataFrame(attr)
attr_df

  ID Sex  Money       Name
0  1   F   1000      Saito
1  2   F   2000      Horie
2  3   M    500      Kondo
3  4   M    300     Kawada
4  5   F    700  Matsubara

In [119]:
# 練習課題2-7
attr_df[attr_df.Money > 500]

  ID Sex  Money       Name
0  1   F   1000      Saito
1  2   F   2000      Horie
4  5   F    700  Matsubara

In [121]:
attr_df[attr_df['Money'] > 500]

  ID Sex  Money       Name
0  1   F   1000      Saito
1  2   F   2000      Horie
4  5   F    700  Matsubara

In [123]:
#練習課題 2-8
attr_df.groupby('Sex').Money.mean()

Sex
F    1233.333333
M     400.000000
Name: Money, dtype: float64

In [126]:
attr2 = {'ID':['3','4','5'],
         'Math':[60,30,40],
         'English':[80,20,30]
        }
attr_df2 = DataFrame(attr2)
attr_df2

  ID  Math  English
0  3    60       80
1  4    30       20
2  5    40       30

In [132]:
# 練習課題2-9
attr_df.merge(attr_df2)[['Money','Math','English']].mean()

Money      500.000000
Math        43.333333
English     43.333333
dtype: float64